app/views/users/show.html.erb

        <% if @user.posts %>
          <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]