app/controllers/likes_controller.rb

    def show
        @like = Like.find(params[:id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]