app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "location", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "rqrewr§§"], ["location", "asdfafd"], ["user_id", 1], ["created_at", "2019-04-16 12:20:33.739959"], ["updated_at", "2019-04-16 12:20:33.739959"]]
---
    def create
       @post = Post.new(post_params)
       if @post.save

UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2019-04-16 12:20:33.784750"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])
        @post.update(post_params)