app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "full_name" = $1, "user_name" = $2, "user_bio" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["full_name", "Peter Keller"], ["user_name", "LagNoodle"], ["user_bio", "-"], ["updated_at", "2019-04-15 13:13:26.498405"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)